## production: ses_receiving_emails
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 1 to add, 1 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                                      NAME                                       |
|--------|---------------------------------------------------------------------------------|
| add    | `module.ses_receiving_emails.aws_lambda_alias.this[0]`                          |
| update | `module.ses_receiving_emails.aws_cloudwatch_query_definition.lambda_statistics` |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.ses_receiving_emails.aws_cloudwatch_query_definition.lambda_statistics will be updated in-place
  ~ resource "aws_cloudwatch_query_definition" "lambda_statistics" {
        id                  = "8a969c42-346b-42d4-947e-27f77c9cc5d7"
      ~ log_group_names     = [
          ~ "aws_cloudwatch_log_group.this" -> "/aws/lambda/ses_receiving_emails",
        ]
      ~ name                = "Lambda Statistics - ses_receiving_emails" -> "Lambda Statistics / ses_receiving_emails"
        # (2 unchanged attributes hidden)
    }

  # module.ses_receiving_emails.aws_lambda_alias.this[0] will be created
  + resource "aws_lambda_alias" "this" {
      + arn              = (known after apply)
      + description      = "The most recently deployed version of the API"
      + function_name    = "ses_receiving_emails"
      + function_version = "$LATEST"
      + id               = (known after apply)
      + invoke_arn       = (known after apply)
      + name             = "latest"
    }

Plan: 1 to add, 1 to change, 0 to destroy.

Warning: Reference to undefined provider

  on lambda.tf line 4, in module "ses_receiving_emails":
   4:     aws = aws.us-east-1

There is no explicit declaration for local provider name "aws" in
module.ses_receiving_emails, so Terraform is assuming you mean to pass a
configuration for "hashicorp/aws".

If you also control the child module, add a required_providers entry named
"aws" with the source address "hashicorp/aws".

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.logs-1-500-error-1-minute-warning-ses_receiving_emails-api[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.logs-10-500-error-5-minutes-critical-ses_receiving_emails-api[0]"]

21 tests, 19 passed, 2 warnings, 0 failures, 0 exceptions

```

</details>
